zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_i2s.h
/** @defgroup I2S_Clock_Polarity I2S FullDuplex Mode
  * @{
  */
#define I2S_CPOL_LOW                     (0x00000000UL)
#define I2S_CPOL_HIGH                    SPI_I2SCFGR_CKPOL
/**
  * @}
  */

/** @defgroup I2S_MSB_LSB_Transmission I2S MSB LSB Transmission
  * @{
  */
#define I2S_FIRSTBIT_MSB                 (0x00000000UL)
#define I2S_FIRSTBIT_LSB                 SPI_CFG2_LSBFRST
/**
  * @}
  */

/** @defgroup I2S_WSInversion I2S Word Select Inversion
  * @{
  */
#define I2S_WS_INVERSION_DISABLE         (0x00000000UL)
#define I2S_WS_INVERSION_ENABLE          SPI_I2SCFGR_WSINV

/**
  * @}
  */

/** @defgroup I2S_IO_Swap Control I2S IO Swap
  * @{
  */
#define I2S_IO_SWAP_DISABLE               (0x00000000U)
#define I2S_IO_SWAP_ENABLE                SPI_CFG2_IOSWP
/**
  * @}
  */

/** @defgroup I2S_Data_24Bit_Alignment Data Padding 24Bit
  * @{
  */
#define I2S_DATA_24BIT_ALIGNMENT_RIGHT   (0x00000000UL)
#define I2S_DATA_24BIT_ALIGNMENT_LEFT    SPI_I2SCFGR_DATFMT
/**
  * @}
  */
/** @defgroup I2S_Fifo_Threshold I2S Fifo Threshold
  * @{
  */
#define I2S_FIFO_THRESHOLD_01DATA                     (0x00000000UL)
#define I2S_FIFO_THRESHOLD_02DATA                     (0x00000020UL)
#define I2S_FIFO_THRESHOLD_03DATA                     (0x00000040UL)
#define I2S_FIFO_THRESHOLD_04DATA                     (0x00000060UL)
#define I2S_FIFO_THRESHOLD_05DATA                     (0x00000080UL)
#define I2S_FIFO_THRESHOLD_06DATA                     (0x000000A0UL)
#define I2S_FIFO_THRESHOLD_07DATA                     (0x000000C0UL)
#define I2S_FIFO_THRESHOLD_08DATA                     (0x000000E0UL)
#define I2S_FIFO_THRESHOLD_09DATA                     (0x00000100UL)
#define I2S_FIFO_THRESHOLD_10DATA                     (0x00000120UL)
#define I2S_FIFO_THRESHOLD_11DATA                     (0x00000140UL)
#define I2S_FIFO_THRESHOLD_12DATA                     (0x00000160UL)
#define I2S_FIFO_THRESHOLD_13DATA                     (0x00000180UL)
#define I2S_FIFO_THRESHOLD_14DATA                     (0x000001A0UL)
#define I2S_FIFO_THRESHOLD_15DATA                     (0x000001C0UL)
#define I2S_FIFO_THRESHOLD_16DATA                     (0x000001E0UL)
/**
  * @}
  */

/** @defgroup I2S_Master_Keep_IO_State Keep IO State
  * @{
  */
#define I2S_MASTER_KEEP_IO_STATE_DISABLE (0x00000000U)
#define I2S_MASTER_KEEP_IO_STATE_ENABLE  SPI_CFG2_AFCNTR
/**
  * @}
  */

/** @defgroup I2S_SlaveExtendFREDetection Slave Extend FRE Detection
  * @{
  */
#define I2S_SLAVE_EXTEND_FRE_DETECTION_DISABLE (0x00000000U)
#define I2S_SLAVE_EXTEND_FRE_DETECTION_ENABLE  SPI_I2SCFGR_FIXCH
/**
  * @}
  */

/** @defgroup I2S_Interrupts_Definition I2S Interrupts Definition
  * @{
  */
#define I2S_IT_RXP                       SPI_IER_RXPIE
#define I2S_IT_TXP                       SPI_IER_TXPIE
#define I2S_IT_DXP                       SPI_IER_DXPIE
#define I2S_IT_EOT                       SPI_IER_EOTIE
#define I2S_IT_TXTF                      SPI_IER_TXTFIE
#define I2S_IT_UDR                       SPI_IER_UDRIE
#define I2S_IT_OVR                       SPI_IER_OVRIE
#define I2S_IT_FRE                       SPI_IER_TIFREIE
#define I2S_IT_MODF                      SPI_IER_MODFIE
#define I2S_IT_ERR                       (SPI_IER_UDRIE | SPI_IER_OVRIE | SPI_IER_TIFREIE)
/**
  * @}
  */

/** @defgroup I2S_Flags_Definition I2S Flags Definition
  * @{
  */
#define I2S_FLAG_RXP                     SPI_SR_RXP       /* I2S status flag : Rx-Packet available flag               */
#define I2S_FLAG_TXP                     SPI_SR_TXP       /* I2S status flag : Tx-Packet space available flag         */
#define I2S_FLAG_DXP                     SPI_SR_DXP       /* I2S status flag : Dx-Packet space available flag         */
#define I2S_FLAG_EOT                     SPI_SR_EOT       /* I2S status flag : End of transfer flag                   */
#define I2S_FLAG_TXTF                    SPI_SR_TXTF      /* I2S status flag : Transmission Transfer Filled flag      */
#define I2S_FLAG_UDR                     SPI_SR_UDR       /* I2S Error flag  : Underrun flag                          */
#define I2S_FLAG_OVR                     SPI_SR_OVR       /* I2S Error flag  : Overrun flag                           */
#define I2S_FLAG_FRE                     SPI_SR_TIFRE     /* I2S Error flag  : TI mode frame format error flag        */
#define I2S_FLAG_SUSP                    SPI_SR_SUSP      /* I2S status flag : Transfer suspend complete flag         */
#define I2S_FLAG_TXC                     SPI_SR_TXC       /* I2S status flag : TxFIFO transmission complete flag      */
#define I2S_FLAG_FRLVL                   SPI_SR_RXPLVL    /* I2S status flag : Fifo reception level flag              */
#define I2S_FLAG_RXWNE                   SPI_SR_RXWNE     /* I2S status flag : RxFIFO word not empty flag             */
#define I2S_FLAG_MASK                    (SPI_SR_RXP | SPI_SR_TXP | SPI_SR_DXP |SPI_SR_UDR | SPI_SR_OVR | SPI_SR_TIFRE)
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup I2S_Exported_macros I2S Exported Macros
  * @{
  */

/** @brief  Reset I2S handle state
  * @param  __HANDLE__ specifies the I2S Handle.
  * @retval None
  */
#if (USE_HAL_I2S_REGISTER_CALLBACKS == 1UL)
#define __HAL_I2S_RESET_HANDLE_STATE(__HANDLE__)                do{                                                  \
                                                                    (__HANDLE__)->State = HAL_I2S_STATE_RESET;       \
                                                                    (__HANDLE__)->MspInitCallback = NULL;            \
                                                                    (__HANDLE__)->MspDeInitCallback = NULL;          \
                                                                  } while(0)
#else
#define __HAL_I2S_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_I2S_STATE_RESET)
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */

/** @brief  Enable the specified SPI peripheral (in I2S mode).
  * @param  __HANDLE__ specifies the I2S Handle.
  * @retval None
  */
#define __HAL_I2S_ENABLE(__HANDLE__)    (SET_BIT((__HANDLE__)->Instance->CR1, SPI_CR1_SPE))

/** @brief  Disable the specified SPI peripheral (in I2S mode).
  * @param  __HANDLE__ specifies the I2S Handle.
  * @retval None
  */
#define __HAL_I2S_DISABLE(__HANDLE__) (CLEAR_BIT((__HANDLE__)->Instance->CR1, SPI_CR1_SPE))

