zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_i2s.h
#define IS_I2S_AUDIO_FREQ(__FREQ__)                ((((__FREQ__) >= I2S_AUDIOFREQ_8K)                    && \
                                                     ((__FREQ__) <= I2S_AUDIOFREQ_192K))                 || \
                                                    ((__FREQ__) == I2S_AUDIOFREQ_DEFAULT))

#define IS_I2S_CPOL(__CPOL__)                       (((__CPOL__) == I2S_CPOL_LOW)                        || \
                                                     ((__CPOL__) == I2S_CPOL_HIGH))

#define IS_I2S_FIRST_BIT(__BIT__)                   (((__BIT__) == I2S_FIRSTBIT_MSB)                     || \
                                                     ((__BIT__) == I2S_FIRSTBIT_LSB))

#define IS_I2S_WS_INVERSION(__WSINV__)              (((__WSINV__) == I2S_WS_INVERSION_DISABLE)           || \
                                                     ((__WSINV__) == I2S_WS_INVERSION_ENABLE))

#define IS_I2S_IO_SWAP(__IOSWAP__)                  (((__IOSWAP__) == I2S_IO_SWAP_DISABLE)               || \
                                                     ((__IOSWAP__) == I2S_IO_SWAP_ENABLE))

#define IS_I2S_DATA_24BIT_ALIGNMENT(__ALIGNMENT__)  (((__ALIGNMENT__) == I2S_DATA_24BIT_ALIGNMENT_RIGHT) || \
                                                     ((__ALIGNMENT__) == I2S_DATA_24BIT_ALIGNMENT_LEFT))

#define IS_I2S_FIFO_THRESHOLD(THRESHOLD)            (((THRESHOLD) == I2S_FIFO_THRESHOLD_01DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_02DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_03DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_04DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_05DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_06DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_07DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_08DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_09DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_10DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_11DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_12DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_13DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_14DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_15DATA) || \
                                                     ((THRESHOLD) == I2S_FIFO_THRESHOLD_16DATA))

#define IS_I2S_MASTER_KEEP_IO_STATE(__AFCNTR__)     (((__AFCNTR__) == I2S_MASTER_KEEP_IO_STATE_DISABLE)  || \
                                                     ((__AFCNTR__) == I2S_MASTER_KEEP_IO_STATE_ENABLE))

#define IS_I2S_SLAVE_EXTEND_FRE_DETECTION(FIXCH)    (((FIXCH) == I2S_SLAVE_EXTEND_FRE_DETECTION_DISABLE) || \
                                                     ((FIXCH) == I2S_SLAVE_EXTEND_FRE_DETECTION_ENABLE))

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_HAL_I2S_H */
